app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      flash.now[:danger] = "Password can't be empty"
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$jNW9paL25.T22o6cuHyuzetISCTL3kLgxmynHM0pea7hW7pJSpwDG"], ["updated_at", "2015-07-06 00:56:26.905464"], ["id", 102]]